implement-verify-service/test-results/java-repo/pipeline-output/java-design-patterns/test/diagrams/package-structure.puml
@startuml
title Package Structure

[abstract-document/src/main/java/com/iluwatar/abstractdocument] --> [abstract-document/src/main/java/com/iluwatar/abstractdocument/domain]
[abstract-document/src/main/java/com/iluwatar/abstractdocument/domain] --> [abstract-document/src/main/java/com/iluwatar/abstractdocument/domain/enums]

@enduml
